# <font color='green'>                        Pandas DataFrames:</font>



**Pandas** is a Python library used for data manipulation and analysis. Pandas provides a convenient way to analyze and clean data.

The Pandas library introduces two new data structures to Python - **Series and DataFrame,** both of which are built on top of Numpy.




### Reasons why we should use Pandas:

- Handle Large Data Efficiently
- Tabular Data Representation
- Free and Open-Source




### Pandas Used for:

Pandas is a powerful library generally used for:

- Data Cleaning
- Data Transformation
- Data Analysis
- Machine Learning
- Data Visualization

In [1]:
# We can create a Pandas array using a Python List.

import pandas as pd

data = [2, 4, 6, 8]    # create a list

array1 = pd.array(data)   # create Pandas array using data
print(array1)

<PandasArray>
[2, 4, 6, 8]
Length: 4, dtype: int32

## <font color='blue'>Pandas Series:</font>

A **Pandas Series** is a one-dimensional labeled array-like object that can hold data of any type.



There are multiple ways to create a Pandas Series,  but the most common way is by using a Python list.

In [2]:
# create a series from the list

import pandas as pd

data = [10, 20, 30, 40, 50]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

## <font color='blue'>Pandas DataFrames:</font>


A **DataFrame** is like a table format where the data is organized in rows and columns. It is a two-dimensional data structure like a two-dimensional array.

####      Syntax :- pandas.DataFrame(data, index, columns)

- data :- Which to be created.

- index :- Its Optional.

- columns :- Provide Coloumns names.

In [3]:
# Create a simple Pandas DataFrame

import pandas as pd

data = [420, 380, 390]

df = pd.DataFrame(data)
print(df)

     0
0  420
1  380
2  390

####  1.  Creating DataFrame Using  List.

In [4]:
import pandas as pd

marks= [['Maths', 90],
       ['Stats', 95],
       ['English', 85]]

# create a DataFrame from the list
df = pd.DataFrame(marks, columns=['Subject', 'score'])

print(df)

   Subject  score
0    Maths     90
1    Stats     95
2  English     85

#### 2. Creating DataFrame Using Python Dictionary.

In [5]:
import pandas as pd

# create a dictionary
data = {'Name': ['sachin', 'Thanmay', 'Tejas'],
       'Age': [24, 30, 26],
       'City': ['Bangalore', 'Mangalore', 'Mysore']}
df=pd.DataFrame(data)
print(df)

      Name  Age       City
0   sachin   24  Bangalore
1  Thanmay   30  Mangalore
2    Tejas   26     Mysore

## <font color='blue'>Named Indexes:</font>

In Pandas, an index refers to the labeled array that identifies rows or columns in a DataFrame.


With the  help of index argument, we can name your own indexes.

In [6]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

Use the named index in the **loc()** attribute to return the specified row(s).

In [7]:
#refer to the named index:

print(df.loc["day2"])

calories    380
duration     40
Name: day2, dtype: int64

## <font color='blue'>Dataframe Operations and Manipulations:</font>

Pandas DataFrame objects come with a variety of built-in functions like **head(), tail() and info()** that allow us to view and analyze DataFrames.

In [8]:
import pandas as pd

data={"Name":["sachin","tejas","samskruthi","thanmay","arjun","sumanth","gagan"],
       "Score":[95,98,90,80,55,64,75],
        "age":[25, 30, 35, 28, 32, 27, 40,]}
df=pd.DataFrame(data)
print(df)

         Name  Score  age
0      sachin     95   25
1       tejas     98   30
2  samskruthi     90   35
3     thanmay     80   28
4       arjun     55   32
5     sumanth     64   27
6       gagan     75   40

In [9]:
# display the first five rows
df.head()

         Name  Score  age
0      sachin     95   25
1       tejas     98   30
2  samskruthi     90   35
3     thanmay     80   28
4       arjun     55   32

In [10]:
# display the first three rows
df.head(3)

         Name  Score  age
0      sachin     95   25
1       tejas     98   30
2  samskruthi     90   35

In [11]:
# display the last three rows
df.tail()

         Name  Score  age
2  samskruthi     90   35
3     thanmay     80   28
4       arjun     55   32
5     sumanth     64   27
6       gagan     75   40

In [12]:
# get info about dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
Name     7 non-null object
Score    7 non-null int64
age      7 non-null int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

### <font color='blue'>Adding rows/columns to DataFrame:</font>

In [13]:
import pandas as pd
data = {'Name': ["sachin","tejas","samskruthi","thanmay"],
        'Height': [5.7, 6.0, 4.8, 5.9],
        'Qualification': ['BSc', 'BBA', 'MBA', 'BSc']}
df=pd.DataFrame(data)
df

         Name  Height Qualification
0      sachin     5.7           BSc
1       tejas     6.0           BBA
2  samskruthi     4.8           MBA
3     thanmay     5.9           BSc

In [14]:
# Add a New Column

# declare a new list
address = ['Bangalore', 'Mangalore', 'Mysore','hassan']
# assign the list as a column
df["address"]=address
print(df)


# Add a new ROW
print("With Add a Row")

df.loc[len(df.index)] = ['Amy', 5.2, 'BIT','goa']
print(df)

         Name  Height Qualification    address
0      sachin     5.7           BSc  Bangalore
1       tejas     6.0           BBA  Mangalore
2  samskruthi     4.8           MBA     Mysore
3     thanmay     5.9           BSc     hassan
With Add a Row
         Name  Height Qualification    address
0      sachin     5.7           BSc  Bangalore
1       tejas     6.0           BBA  Mangalore
2  samskruthi     4.8           MBA     Mysore
3     thanmay     5.9           BSc     hassan
4         Amy     5.2           BIT        goa

### <font color='blue'>Remove Rows/Columns from  DataFrame:</font>

We can use **drop()** to delete rows and columns from a DataFrame.

In [15]:
import pandas as pd

D = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Felipe'],
        'Age': [25, 30, 35, 40, 22, ],
        'City': ['New York', 'London', 'Paris', 'Tokyo',  'Banglore']}
data = pd.DataFrame(D)
data

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo
4   Felipe   22  Banglore

In [16]:
# delete row with index 4
data.drop(4,axis=0,inplace=True)

# delete row with index 3
data.drop(index=3,inplace=True)
print(data)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [17]:
# delete age column
data.drop("Age",axis=1,inplace=True)


# delete city column 
data.drop(columns='City', inplace=True)
print(data)

      Name
0    Alice
1      Bob
2  Charlie

### <font color='blue'>Rename  Rows/Columns name  in a DataFrame:</font>

- We can rename columns in a Pandas DataFrame using the **rename()** function

In [18]:
import pandas as pd

# create a sample DataFrame
data = {'Name': ['Sachin', 'Tejas', 'Thanmay', 'Samskruthi'],
        'Age': [25, 28, 35, 26],
        'City': ['Bangalore', 'Mysore', 'Hassan', 'Mangalore']}
df = pd.DataFrame(data)
df

         Name  Age       City
0      Sachin   25  Bangalore
1       Tejas   28     Mysore
2     Thanmay   35     Hassan
3  Samskruthi   26  Mangalore

In [19]:
# rename column 'Name' to 'First_Name'
df.rename(columns= {'Name': 'First_Name'}, inplace=True)

# rename columns 'Age' and 'City'
df.rename(mapper= {'Age': 'Number', 'City':'Address'}, axis=1, inplace=True)
df

   First_Name  Number    Address
0      Sachin      25  Bangalore
1       Tejas      28     Mysore
2     Thanmay      35     Hassan
3  Samskruthi      26  Mangalore

In [20]:
# rename column one index label

df.rename(index={0: 7}, inplace=True)
df

   First_Name  Number    Address
7      Sachin      25  Bangalore
1       Tejas      28     Mysore
2     Thanmay      35     Hassan
3  Samskruthi      26  Mangalore

### <font color='blue'>Indexing and Slicing:</font>


- We can access columns of a DataFrame using the **bracket ([ ]) operator.**


- We can use **.loc** to access the data from a dataframe using its indexes.

In [21]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 32, 18, 47, 33],
    'City': ['New York', 'Paris', 'London', 'Tokyo', 'Sydney'],
    'Qualification': ['BSc', 'BBA', 'MBA', 'BSc','BE']}

df = pd.DataFrame(data)

# access the Name column

name=df["Name"]
name

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [22]:
# access multiple columns
name_city= df[['Name','City']]
name_city

      Name      City
0    Alice  New York
1      Bob     Paris
2  Charlie    London
3    David     Tokyo
4      Eve    Sydney

In [23]:
# access a single row
single_row = df.loc[2]
single_row

Name             Charlie
Age                   18
City              London
Qualification        MBA
Name: 2, dtype: object

In [24]:
# access second row of 'Name' column
specific_value = df.loc[1, 'Name']
specific_value

'Bob'

In [25]:
# slice rows from index 1 to 3

slice_rows = df.loc[1:3]
slice_rows

      Name  Age    City Qualification
1      Bob   32   Paris           BBA
2  Charlie   18  London           MBA
3    David   47   Tokyo           BSc

In [26]:
# slicing columns from 'Name' to City'
slice_columns = df.loc[:, 'Name':'City']
slice_columns

      Name  Age      City
0    Alice   25  New York
1      Bob   32     Paris
2  Charlie   18    London
3    David   47     Tokyo
4      Eve   33    Sydney

### <font color='blue'>filter the data.</font>






- Here we can use **loc[] method or filter() Method**

In [27]:
import pandas as pd

data={
    "ID":[101,102,103,104],
    "Score":[20,30,40,50],
    "wik":[1,2,3,4] }

df = pd.DataFrame(data)

 
#FilteringData where the value of Score is greater than 30.

filtered = df.loc[df["Score"] > 30]
print(filtered)

#Filtering Data only Score columns using
score =df.loc[df["Score"]>30,"Score"]
print(score)


wik= df[df.wik >= 2]
print(wik)

    ID  Score  wik
2  103     40    3
3  104     50    4
2    40
3    50
Name: Score, dtype: int64
    ID  Score  wik
1  102     30    2
2  103     40    3
3  104     50    4

In [28]:
import pandas as pd

data={"name":["sachin","arjun","tejas","sai"],
      "Department": ['HR', 'Marketing', 'Marketing', 'IT'],
        "Salary": [50000, 60000, 55000, 70000] }

df=pd.DataFrame(data)

# use the filter() method to select columns based on a condition
columns=df.filter(items=["Salary","Department"])
print(columns)

   Salary Department
0   50000         HR
1   60000  Marketing
2   55000  Marketing
3   70000         IT

In [29]:
col =df[["name","Department"]]
col

     name Department
0  sachin         HR
1   arjun  Marketing
2   tejas  Marketing
3     sai         IT

In [30]:
# use logical operators to filter

salary =df[df.Salary > 55000]
salary

    name Department  Salary
1  arjun  Marketing   60000
3    sai         IT   70000

### <font color='blue'>Sorting:</font>


- Sorting is a fundamental operation in data manipulation and analysis that involves arranging data in a specific order.



- **sort_values()** function to sort a DataFrame

In [31]:
#sort DataFrame by Age in ascending order

import pandas as pd

data = {'Name': ['sachin', 'arjun', 'prasadha'],
        'Age': [28, 22, 25],
       'Score': [85, 90, 75]}
df = pd.DataFrame(data)

sort=df.sort_values(by="Age")
print(sort)


# To sort values in descending order, we use the ascending parameter with False

sorted_df = df.sort_values(by='Age', ascending=False)
print(sorted_df)

       Name  Age  Score
1     arjun   22     90
2  prasadha   25     75
0    sachin   28     85
       Name  Age  Score
0    sachin   28     85
2  prasadha   25     75
1     arjun   22     90

In [32]:
# Sort DataFrame by 'Age' and then by 'Score' (Both in ascending order)
df1 = df.sort_values(by=['Age', 'Score'])
df1

       Name  Age  Score
1     arjun   22     90
2  prasadha   25     75
0    sachin   28     85

In [33]:
#  Sort DataFrame by 'Age' in ascending order, and then by 'Score' in descending order
df2= df.sort_values(by=['Age', 'Score'],ascending=[True, False])
df2

       Name  Age  Score
1     arjun   22     90
2  prasadha   25     75
0    sachin   28     85

### <font color='blue'>Select.</font>


- Pandas **select** refers to the process of extracting specific portions of data from a DataFrame.



- The **query()** method in Pandas allows you to select data using a more SQL-like syntax.

In [34]:
# select the rows where the age is greater than 25

import pandas as pd
data = {
    'Name': ['sachin', 'samskruthi', 'tejas', 'dharshan', 'thanmay'],
    'Age': [25, 30, 22, 28, 35],
    'Score': [85, 90, 75, 80, 95]
}

df = pd.DataFrame(data)


age= df.query("Age >25 ")
age

         Name  Age  Score
1  samskruthi   30     90
3    dharshan   28     80
4     thanmay   35     95


### <font color='blue'>Pandas Multi-Index:</font>

A MultiIndex in Pandas is a hierarchical indexing structure that allows us to represent and work with **higher-dimensional** data efficiently.

A MultiIndex contains **multiple levels of indexes.** Each column in a MultiIndex is linked to one another through a parent/relationship.

In [35]:
import pandas as pd

data = {
    "Continent": ["North America", "Europe", "Asia", "North America", "Asia", "Europe", "North America", "Asia", "Europe", "Asia"],
    "Country": ["United States", "Germany", "China", "Canada", "Japan", "France", "Mexico", "India", "United Kingdom", "Nepal"],
    "Population": [331002651, 83783942, 1439323776, 37742154, 126476461, 65273511, 128932753, 1380004385, 67886011, 29136808]
}

df=pd.DataFrame(data)
# sort the data by continent
df.sort_values("Continent",inplace=True)

# create a multiindex
df.set_index(["Continent","Country"],inplace=True)

print(df)

                              Population
Continent     Country
Asia          China           1439323776
              Japan            126476461
              India           1380004385
              Nepal             29136808
Europe        Germany           83783942
              France            65273511
              United Kingdom    67886011
North America United States    331002651
              Canada            37742154
              Mexico           128932753

### <font color='blue'>pivot() and pivot_table():</font>


- In Pandas reshaping data refers to the process of converting a DataFrame from one format to another for better data visualization and analysis.


- Pandas provides multiple methods like **pivot(), pivot_table(), stack(), unstack() and melt()** to reshape data



- **pivot():---** Does not allow aggregation of data and Only accepts a single-level index.



- **pivot_table():---**  Allows aggregation (sum, mean, count, etc.) and  Accepts multi-level index for complex data


- In Pandas, the **pivot()** function reshapes data based on column values.

In [36]:
import pandas as pd

data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
        'Temperature': [32, 75, 30, 77]}
df=pd.DataFrame(data)

# Pivot the  DataFrame
pivot = df.pivot(index="Date",columns="City",values="Temperature")  
print(pivot)

# Index   :- the column to use as row labels
# columns :- the column that will be reshaped as columns
# values  :- the column(s) to use for the new DataFrame's values

City        Los Angeles  New York
Date
2023-01-01           75        32
2023-01-02           77        30

**pivot_table()** :- 


- It allows us to create a pivot table that aggregates and summarizes data based on the specified index, 
  columns, and aggregation functions.

- **pd.pivot_table(dataname, Index, Columns, Values, aggfunc) :-**  


-  **Index**:-  the column to use as row labels


- **columns**: the column that will be reshaped as columns


- **Value**:- the column(s) to use for the new DataFrame's values


- **aggfunc**:-   the function to use for aggregation, defaulting to 'mean'

In [37]:
import pandas as pd
import numpy as np

data = {
    'Category': ['A', 'A', 'B', 'B', 'A'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York'],
    'Temperature': [32, 75, 30, 78, 34],
    'Humidity': [80, 50, 85, 48, 75] }


df=pd.DataFrame(data)

pivot = df.pivot_table(index='Category', values=['Temperature','Humidity'], columns='City', aggfunc='mean')
pivot

            Humidity          Temperature
City     Los Angeles New York Los Angeles New York
Category
A               50.0     77.5          75       33
B               48.0     85.0          78       30

**Handle Missing Values With pivot_table()**

In [38]:
import pandas as pd
import numpy as np

data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-03', '2023-01-03', '2023-01-03'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago'],
        'Temperature': [32, 75, 30, 77, np.nan, 76, np.nan]}
df = pd.DataFrame(data)

# create a pivot table
pivot_df = df.pivot_table(index='Date', columns='City', values='Temperature')

print("\nDefault Pivot Table\n", pivot_df)

# create a pivot table with dropna=True
pivot_df_dropna = df.pivot_table(index='Date', columns='City', values='Temperature', dropna=False)

print("\nPivot Table with dropna=False:\n", pivot_df_dropna)

# create a pivot table with fill_value=0
pivot_df_dropna = df.pivot_table(index='Date', columns='City', values='Temperature',dropna=False, fill_value=0)

print("\nPivot Table with fill_value=0:\n", pivot_df_dropna)

Default Pivot Table
 City        Los Angeles  New York
Date
2023-01-01         75.0      32.0
2023-01-02         77.0      30.0
2023-01-03         76.0       NaN

Pivot Table with dropna=False:
 City        Chicago  Los Angeles  New York
Date
2023-01-01      NaN         75.0      32.0
2023-01-02      NaN         77.0      30.0
2023-01-03      NaN         76.0       NaN

Pivot Table with fill_value=0:
 City        Chicago  Los Angeles  New York
Date
2023-01-01        0           75        32
2023-01-02        0           77        30
2023-01-03        0           76         0

### <font color='blue'>Duplicate Values:</font>

In [39]:
# duplicated() method returns True if a row is duplicated and returns False otherwise.

data = {
    'Name': ['sachin', 'tejas', 'Johnny', 'tejas', 'sachin','tejas'],
    'Age': [28, 24, 28, 24, 19,24],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago','Los Angeles'] }
df=pd.DataFrame(data)

# check for duplicate entries
print(df.duplicated())

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [40]:
# Find Duplicates Based on Columns

print(df.duplicated(subset=['Name', 'Age']))

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [41]:
# Remove Duplicate Entries.

print(df.drop_duplicates())

     Name  Age         City
0  sachin   28     New York
1   tejas   24  Los Angeles
2  Johnny   28     New York
4  sachin   19      Chicago

In [42]:
# remove duplicates, keep last entries
a =df.drop_duplicates(keep='last')
print(a)

     Name  Age         City
0  sachin   28     New York
2  Johnny   28     New York
4  sachin   19      Chicago
5   tejas   24  Los Angeles

###  <font color='blue'>Convert  Categorical data To Numeric Data:</font>



- **Factosize** method they will take default values (0,1,2,3)





- **replace()** method we can give our own

In [43]:
# Factorize Method

import pandas as pd

data= {"Education":["Under-Graduate","Post-Graduate","Under-Graduate","Post-Graduate"]}
df=pd.DataFrame(data)


# Convert categorical to numeric using factorize
df['Education_numeric'], Education = pd.factorize(df['Education'])
print(df)


# Replace() method:

df['Education'].replace(['Under-Graduate', 'Post-Graduate'],[0, 1],inplace=True)
print(df)

        Education  Education_numeric
0  Under-Graduate                  0
1   Post-Graduate                  1
2  Under-Graduate                  0
3   Post-Graduate                  1
   Education  Education_numeric
0          0                  0
1          1                  1
2          0                  0
3          1                  1

###  <font color='blue'>Convert Numeric data To catergorical Data:</font>

In [44]:
import pandas as pd

data= {"Education":[1,2,1,2]}
df=pd.DataFrame(data)


# Method 1 : Replace() method:

df['Education'].replace([1,2],["Under-Graduate", "Post-Graduate"],inplace=True)
print(df)


# method 2:

# Example numeric data
numeric_data = [10, 25, 5, 18, 30, 15, 7, 21]

# Define a function to map numeric values to categories
def map_to_category(value):
    if value < 10:
        return 'Small'
    elif 10 <= value < 20:
        return 'Medium'
    else:
        return 'Large'

# Apply the function to each value
categories = [map_to_category(value) for value in numeric_data]

print(categories)

        Education
0  Under-Graduate
1   Post-Graduate
2  Under-Graduate
3   Post-Graduate
['Medium', 'Large', 'Small', 'Medium', 'Large', 'Medium', 'Small', 'Large']

### <font color='blue'>Merging AND Concatenating DataFrames:</font>

**Concatenating**


- With the help of this Concatenating function we cam combine two dataframes either Horizontal OR Vertical without using Colums

In [45]:
import pandas as pd

df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['sachin', 'tejas', 'thanmay', 'Dharshan']})
 

df2 = pd.DataFrame({'id': ['B05', 'B06', 'B07', 'B08'],
                    'Name': ['samskruthi', 'gagan', 'ravi', 'arjun']})

 
concat= pd.concat([df1,df2],axis=1)                    # axis = 1 -----------------> Horizontal
print(concat)                                          # axis = 0 -----------------> Vertical

    id      Name   id        Name
0  A01    sachin  B05  samskruthi
1  A02     tejas  B06       gagan
2  A03   thanmay  B07        ravi
3  A04  Dharshan  B08       arjun

**Merging**

- The merge() operation is a method used to combine two dataframes based on one or more common columns, also called keys.

In [46]:
import pandas as pd

# Sample DataFrames
df1= pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'name': ['sachin', 'tejas', 'thanmay', 'Dharshan'],
    'age': [25, 30, 35, 40] })

df2 = pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'department': ['HR', 'Engineering', 'Marketing', 'Finance'] })


# Merge based on 'employee_id'
merge = pd.merge(df1,df2, on='employee_id' )
print(merge)

   employee_id      name  age   department
0            1    sachin   25           HR
1            2     tejas   30  Engineering
2            3   thanmay   35    Marketing
3            4  Dharshan   40      Finance

### <font color='blue'>Describe:</font>

In [47]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'Weight': [45, 46, 47, 48, 50]
}

df=pd.DataFrame(data)
df1=df["Age"].describe()
print(df1)

df2=df.describe()
df2

count     5.000000
mean     35.000000
std       7.905694
min      25.000000
25%      30.000000
50%      35.000000
75%      40.000000
max      45.000000
Name: Age, dtype: float64

             Age     Weight
count   5.000000   5.000000
mean   35.000000  47.200000
std     7.905694   1.923538
min    25.000000  45.000000
25%    30.000000  46.000000
50%    35.000000  47.000000
75%    40.000000  48.000000
max    45.000000  50.000000

### <font color='blue'>Grouping AND Aggregating functions:</font>

In [48]:
import pandas as pd

data=pd.read_excel("E:/Z.Sachin/2.excel/sales data.xlsx") 
print(data.head())

#Region wise sum of Units.
data1=data.groupby("Region")["Units"].sum()
print(data1)


data2=data.groupby("Region").mean()
print(data2)

   OrderDate  year  Month   Region  Manager   SalesMan          Item  Units  \
0 2018-01-06  2018      1     East   Martha  Alexander    Television     95
1 2018-01-23  2018      1  Central  Hermann     Shelli  Home Theater     50
2 2018-02-09  2018      2  Central  Hermann       Luis    Television     36
3 2018-02-26  2018      2  Central  Timothy      David    Cell Phone     27
4 2018-03-15  2018      3     West  Timothy    Stephen    Television     56

   Unit_price  Sale_amt
0      1198.0  113810.0
1       500.0   25000.0
2      1198.0   43128.0
3       225.0    6075.0
4      1198.0   67088.0
Region
Central    1199
East        691
West        231
Name: Units, dtype: int64
                year     Month      Units  Unit_price      Sale_amt
Region
Central  2018.583333  6.541667  49.958333  645.458333  34573.729167
East     2018.230769  6.769231  53.153846  442.038462  24692.846154
West     2018.666667  6.333333  38.500000  624.333333  25816.500000

In [49]:
ds = data["Manager"].unique()
print(ds)

['Martha' 'Hermann' 'Timothy' 'Douglas']

In [50]:
#  Group the DataFrame by Region and Manager, then apply the aggregate functions

grouped = data.groupby(['Region', 'Manager'])['Units'].agg(['mean', 'max'])
print(grouped)

                      mean  max
Region  Manager
Central Douglas  52.000000   87
        Hermann  53.916667   96
        Martha   45.750000   75
        Timothy  42.600000   80
East    Douglas  56.666667   81
        Martha   52.100000   96
West    Douglas  44.500000   57
        Timothy  35.500000   76

**Aggregating Functions**



- This can be really useful for tasks such as calculating **mean, sum, count, and other statistics for different groups** within our data.

In [51]:
# we can use to make a statistacal calculations

import pandas as pd

data={"Category":['A', 'A', 'B', 'B', 'A', 'B'],
        "Value": [10, 15, 20, 25, 30, 35]}
df= pd.DataFrame(data)

#  calculate total sum of the Value column
sum= df["Value"].agg("sum")
print(sum)


# Like that we calculate mean, max,min etc

135

In [52]:
# applying multiple aggregation functions to a single column

result = df.groupby('Category')['Value'].agg(['sum', 'mean', 'max', 'min'])
print(result)

          sum       mean  max  min
Category
A          55  18.333333   30   10
B          80  26.666667   35   20